{
  "title": "Choking Guide",
  "steps": [
    {
      "title": "Ask if They Can Cough",
      "description": "Identify the type of choking. If the person is able to cough, speak, or make sounds, this indicates a partial blockage. Encourage them to keep coughing forcefully, as this is the most effective way to clear a partial obstruction. Do not interfere with their efforts to cough."
    },
    {
      "title": "Call for Help",
      "description": "If the person cannot breathe, cough, or make any sound, or is clutching their throat (the universal choking sign), this is a complete blockage. Immediately shout for help and tell someone to call your local emergency medical services (like 911). Time is critical."
    },
    {
      "title": "Give Back Blows",
      "description": "Stand to the side and slightly behind the adult or child. Support their chest with one hand and lean them forward so that the object is expelled outward. Deliver up to 5 sharp, firm back blows between the shoulder blades using the heel of your other hand. Check after each blow to see if the obstruction has cleared."
    },
    {
      "title": "Perform Abdominal Thrusts (Heimlich)",
      "description": "If back blows fail, perform abdominal thrusts. Stand behind the person, place a fist just above their navel (well below the breastbone). Grasp your fist with your other hand and give quick, inward and upward thrusts. Each thrust is a separate attempt to dislodge the object. Perform up to 5 thrusts."
    },
    {
      "title": "Alternate if Needed",
      "description": "Continue cycles of 5 back blows followed by 5 abdominal thrusts. Persist with this sequence until the object is dislodged, the person can breathe or cough normally, the person becomes unresponsive, or professional medical help arrives and takes over."
    },
    {
      "title": "If Person Becomes Unresponsive",
      "description": "Carefully lower the person to the ground. Immediately shout for someone to call emergency services and get an AED if available. Begin CPR, starting with chest compressions. Before giving rescue breaths, open the airway and look for the object. If you see it, remove it with a finger sweep. Never perform a blind finger sweep. Continue cycles of 30 compressions and 2 breaths."
    }
  ],
  "video": "https://www.youtube.com/watch?v=etyEWWEtbqI"
}